// Напишите программу, которая 
// принимает на вход координаты двух точек и 
// находит расстояние между ними в 3D пространстве


Console.Write("Введите пятизначное число: ");
int num = Convert.ToInt32(Console.ReadLine());



