// Напишите программу, которая 
// выводит массив из 8 элементов, 
// заполненный нулями и единицами в случайном порядке.

// [1,0,11,0,1,0,0]
//  0 1  2 3 4 5 6


int[] array = new int [8]; // создание массива
for (int i = 0; i < array.length; i++)   // движение мо масиву
{
    Console.Write(array[i] + " ");
}

